app/controllers/contact_us_controller.rb

  def index
    @contact_us = ContactU.all
---
SELECT "contact_us".* FROM "contact_us"

    def set_contact_u
      @contact_u = ContactU.find(params[:id])
---
SELECT  "contact_us".* FROM "contact_us" WHERE "contact_us"."id" = $1 LIMIT 1  [["id", 0]]