app/controllers/inventories_controller.rb

  def index
    @inventories = Inventory.all
---
SELECT "inventories".* FROM "inventories"

  def create
    @inventory = Inventory.new(inventory_params)

    respond_to do |format|
      if @inventory.save
---
INSERT INTO "inventories" ("tables", "chairs", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tables", 10], ["chairs", 100], ["created_at", "2017-01-03 00:24:51.803947"], ["updated_at", "2017-01-03 00:24:51.803947"]]

    def set_inventory
      @inventory = Inventory.find(params[:id])
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT 1  [["id", 1]]