app/controllers/main_pages_controller.rb

  def index
    @main_pages = MainPage.all
    @inventories = Inventory.all
---
SELECT "inventories".* FROM "inventories"