app/controllers/main_pages_controller.rb

  def index
    if user_signed_in?
      redirect_to new_user_choice_path
   else
     @main_pages = MainPage.all
---
SELECT "main_pages".* FROM "main_pages"

    def create
    @customer_orders = MainPage.new(@customer_order_params)

    respond_to do |format|
      if @customer_orders.save
---
INSERT INTO "main_pages" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-01-03 00:27:57.844411"], ["updated_at", "2017-01-03 00:27:57.844411"]]

    def set_main_page
      @main_page = MainPage.find(params[:id])
---
SELECT  "main_pages".* FROM "main_pages" WHERE "main_pages"."id" = $1 LIMIT 1  [["id", 1]]