app/controllers/user_choices_controller.rb

SELECT "user_choices".* FROM "user_choices"
---
  def index
    @user_choices = UserChoice.all

INSERT INTO "user_choices" ("table_quantity", "chair_quantity", "city", "price", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["table_quantity", 5], ["chair_quantity", 40], ["city", "Tracy"], ["price", 95], ["date", "2017-01-07"], ["created_at", "2017-01-06 03:43:37.168756"], ["updated_at", "2017-01-06 03:43:37.168756"]]
---
  def create
    @user_choice = UserChoice.new(user_choice_params)
    @user_choice.first_name = current_user.first_name
    @user_choice.last_name = current_user.last_name

    respond_to do |format|
      if @user_choice.save

DELETE FROM "user_choices" WHERE "user_choices"."id" = $1  [["id", 1]]
---
  def destroy
    @user_choice.destroy

SELECT  "user_choices".* FROM "user_choices" WHERE "user_choices"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_user_choice
      @user_choice = UserChoice.find(params[:id])